Repository: YomenT/linux-desktop-monitor
Catalog: po/*.po
Languages: nl

source: Connect to Desktop
nl: Verbinding maken met computer

source: Desktop Server Settings
nl: Computerserverinstellingen

source: First, start the server on your desktop: python3 desktop_monitor_server.py
nl: Start de server op je computer: python3 desktop_monitor_server.py

source: Desktop IP address (e.g., 192.168.1.100)
nl: IP-adres van computer (bijv. 192.168.1.100)

source: Auth Token (optional)
nl: Verificatiesleutel (optioneel)

source: Auth Token (optional, leave empty if not set)
nl: Verificatiesleutel (optioneel - laat leeg indien niet van toepassing)

source: Port (default: 8080)
nl: Poort (standaard: 8080)

source: 📖 Setup Instructions
nl: 📖 Instelhulp

source: Connect
nl: Verbinden

source: Debug Logs
nl: Foutopsporingslogboeken

source: Clear
nl: Wissen

source: System Information
nl: Systeeminformatie

source: Hostname:
nl: Hostnaam:

source: CPU Usage:
nl: Cpu-gebruik:

source: RAM Usage:
nl: Ram-gebruik:

source: Temperature:
nl: Temperatuur:

source: Refresh
nl: Herladen

source: 📁 Browse Desktop Files
nl: 📁 Computerbestanden verkennen

source: 🖥️ Remote Desktop
nl: 🖥️ Extern bureaublad

source: ⚠️ Shutdown Desktop
nl: ⚠️ Computer afsluiten

source: Setup Guide
nl: Instelhulp

source: Close
nl: Sluiten

source: How It Works
nl: Hoe werkt dit?

source: This app connects to a simple web server running on your desktop. The server gathers system metrics and provides them via HTTP, which works perfectly with Ubuntu Touch's security model.
nl: Deze app maakt verbinding met een eenvoudige webserver op je computer. De server verzamelt systeeminformatie en biedt die via http aan de app aan, volledig in lijn met het beveiligingsbeleid van Ubuntu Touch.

source: Step 1: Download Server Script
nl: Stap 1: download het serverscript

source: Download the server script from our documentation:
nl: Download het serverscript vanuit de documentatie:

source: Or the script is included in the app source code as desktop_monitor_server.py
nl: Of het script genaamd ‘desktop_monitor_server.py’ in de broncode van de app

source: Step 2: Start Server on Desktop
nl: Stap 2: start de server op je computer

source: On your Linux desktop, run:
nl: Voer daarvoor het volgende uit:

source: The server will start on port 8080 and display your IP address.
nl: De server wordt gestart op poort 8080 en toont je IP-adres.

source: Step 3: Connect from App
nl: Stap 3: maak verbinding vanuit de app

source: Enter your desktop's IP address in the app and click Connect!
nl: Voer het IP-adres van je computer in in de app en druk op verbinden!

source: Optional: Security Token
nl: Optioneel: beveiligingssleutel

source: For added security, you can start the server with a token:
nl: Als je meer zekerheid wilt, kun je de server als volgt starten met een verificatiesleutel:

source: Then enter the same token in the Auth Token field in the app.
nl: Voer de sleutel in in het desbetreffende veld in de app.

source: Advanced Options
nl: Geavanceerde opties

source: Got it! Back to Connection
nl: Ik snap het!

source: File Browser
nl: Bestandsverkenner

source: Upload File
nl: Bestand vesturen

source: Path:
nl: Locatie:

source: .. (Parent Directory)
nl: … (bovenliggende map)

source: No files in this directory
nl: Er zijn geen bestanden in deze map

source: Remote Desktop
nl: Extern bureaublad

source: Tap refresh to capture desktop screen
nl: Druk op herladen om het scherm te tonen

source: Zoom:
nl: Zoomniveau:

source: Reset Zoom
nl: Oorspronkelijk zoomniveau

source: Virtual Keyboard
nl: Virtueel toetsenbord

source: Type text to send to your desktop:
nl: Typ tekst bestemd voor de computer:

source: Type here...
nl: Typ hier…

source: Send Text
nl: Tekst versturen

source: Special Keys:
nl: Speciale toetsen:

source: Download File
nl: Bestand downloaden

source: File:
nl: Bestand:

source: Save to:
nl: Opslaan in:

source: Enter destination path
nl: Kies een locatie

source: Files save to app folder by default. Access downloaded files: 1. Open File Manager 2. Navigate to: .local/share/linux-desktop-monitor.../ Or copy path from logs after download.
nl: Bestanden worden standaard opgeslagen in de appmap. Je kunt ze als volgt opvragen: 1. Open de bestandsbeheerder; 2. Ga naar .local/share/linux-desktop-monitor.../ Of kopieer de locatie uit het downloadlogboek.

source: Cancel
nl: Annuleren

source: Download
nl: Downloaden

source: Upload File to Desktop
nl: Bestand versturen naar computer

source: Destination on Desktop:
nl: Bestemming op computer:

source: ℹ️ The file will be uploaded to the folder shown above on your desktop where the server is running.
nl: ℹ️ Het bestand wordt naar bovenstaande map verstuurd, op de computer waarop de server draait.

source: File path on your phone:
nl: Bestandslocatie op telefoon:

source: Upload
nl: Versturen

source: Connected successfully!
nl: Er is verbinding gemaakt!

source: Error:
nl: Foutmelding:

source: Desktop shutdown initiated
nl: De computer wordt afgesloten

source: Shutdown failed:
nl: Het afsluiten is mislukt:

source: Downloaded:
nl: Gedownload:

source: Uploaded:
nl: Geüpload:

source: Connecting...
nl: Bezig met verbinden…

source: Error: Connection manager not available -
nl: Foutmelding: verbindingsbeheer is niet beschikbaar -

source: Shutdown Desktop?
nl: Afsluiten bevestigen

source: This will shutdown your desktop computer
nl: De volgende computer wordt afgesloten:

source: . Are you sure?
nl: . Weet je het zeker?

source: Shutdown
nl: Afsluiten

source: Linux Desktop Monitor
nl: Linux-computerbeheer
